from pyrogram import Client, filters
from pyrogram.errors import FloodWait
from time import sleep

import config

api_ID = config.api_ID
api_HASH = config.api_HASH

about = ''

app = Client(name="my_account", api_id=api_ID, api_hash=api_HASH)

 #throooooo
@app.on_message(filters.command("touch", prefixes="|") & filters.me)
def touch(_, msg):
    orig_text = msg.text.split("|touch ", maxsplit=1)[1]
    text = orig_text
    tbp = ""
    typing_symbol = "_"

    while (tbp != orig_text):
        try:
            msg.edit(tbp + typing_symbol)
            sleep(0.1)

            tbp = tbp + text[0]
            text = text[1:]

            msg.edit(tbp)
            sleep(0.05)

        except FloodWait as e:
            sleep(e.x)



 #heart 5X5
@app.on_message(filters.command("heart", prefixes="|") & filters.me)
def touch(_, msg):
    orig_text = msg.text.split("|heart ", maxsplit=1)[1]
    text = orig_text

    try:
        tbp = 'I♥U'
        msg.edit(tbp)
        sleep(0.1)

        tbp = '🤍🤍\n🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍\n🤍🤍🤍\n🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍🤍\n🤍🤍🤍🤍\n🤍🤍🤍🤍\n🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        #next step
        tbp = '🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n❤️❤️❤️❤️❤️\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍🤍🤍🤍🤍\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍❤️🤍❤️🤍\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        #NEXT
        tbp = '🤍🧡🤍🧡🤍\n🧡🧡🧡🧡🧡\n🧡🧡🧡🧡🧡\n🤍🧡🧡🧡🤍\n🤍🤍🧡🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍💛🤍💛🤍\n💛💛💛💛💛\n💛💛💛💛💛\n🤍💛💛💛🤍\n🤍🤍💛🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍💚🤍💚🤍\n💚💚💚💚💚\n💚💚💚💚💚\n🤍💚💚💚🤍\n🤍🤍💚🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍💙🤍💙🤍\n💙💙💙💙💙\n💙💙💙💙💙\n🤍💙💙💙🤍\n🤍🤍💙🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '🤍💜🤍💜🤍\n💜💜💜💜💜\n💜💜💜💜💜\n🤍💜💜💜🤍\n🤍🤍💜🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        #final step
        tbp = '🤍❤️🤍❤️🤍\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n🤍❤️❤️❤️🤍\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n🤍🤍❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️❤️❤️\n❤️❤️❤️❤️\n❤️❤️️❤️❤️\n❤️️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️❤️️\n❤️❤️❤️\n❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❤️❤️️\n❤️❤️'
        msg.edit(tbp)
        sleep(0.45)

        tbp = '❣️ '+text+'\n'+about
        msg.edit(tbp)
        sleep(0.45)

    except FloodWait as e:
        sleep(e.x)


#BIG HEART 9X9
@app.on_message(filters.command("bHeart", prefixes="|") & filters.me)
def touch(_, msg):
    orig_text = msg.text.split("|bHeart ", maxsplit=1)[1]
    try:
        tbp = 'I♥U'
        msg.edit(tbp)
        sleep(0.1)

        tbp = '🤍🤍\n🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍\n🤍🤍🤍\n🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍\n🤍🤍🤍🤍\n🤍🤍🤍🤍\n🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        #next

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️🤍🤍❤️🤍🤍❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        #next

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🧡🧡🤍🧡🧡🤍🤍\n🤍🧡🧡🧡🧡🧡🧡🧡🤍\n🤍🧡🧡🧡🧡🧡🧡🧡🤍\n🤍🧡🧡🧡🧡🧡🧡🧡🤍\n🤍🤍🧡🧡🧡🧡🧡🤍🤍\n🤍🤍🤍🧡🧡🧡🤍🤍🤍\n🤍🤍🤍🤍🧡🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💛💛🤍💛💛🤍🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍🤍💛💛💛💛💛🤍🤍\n🤍🤍🤍💛💛💛🤍🤍🤍\n🤍🤍🤍🤍💛🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💚💚🤍💚💚🤍🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍🤍💚💚💚💚💚🤍🤍\n🤍🤍🤍💚💚💚🤍🤍🤍\n🤍🤍🤍🤍💚🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💙💙🤍💙💙🤍🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍🤍💙💙💙💙💙🤍🤍\n🤍🤍🤍💙💙💙🤍🤍🤍\n🤍🤍🤍🤍💙🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💜💜🤍💜💜🤍🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍🤍💜💜💜💜💜🤍🤍\n🤍🤍🤍💜💜💜🤍🤍🤍\n🤍🤍🤍🤍💜🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍🤎🤎🤍🤎🤎🤍🤍\n🤍🤎🤎🤎🤎🤎🤎🤎🤍\n🤍🤎🤎🤎🤎🤎🤎🤎🤍\n🤍🤎🤎🤎🤎🤎🤎🤎🤍\n🤍🤍🤎🤎🤎🤎🤎🤍🤍\n🤍🤍🤍🤎🤎🤎🤍🤍🤍\n🤍🤍🤍🤍🤎🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💙💙🤍💙💙🤍🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍💙💙💙💙💙💙💙🤍\n🤍🤍💙💙💙💙💙🤍🤍\n🤍🤍🤍💙💙💙🤍🤍🤍\n🤍🤍🤍🤍💙🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💚💚🤍💚💚🤍🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍💚💚💚💚💚💚💚🤍\n🤍🤍💚💚💚💚💚🤍🤍\n🤍🤍🤍💚💚💚🤍🤍🤍\n🤍🤍🤍🤍💚🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💜💜🤍💜💜🤍🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍💜💜💜💜💜💜💜🤍\n🤍🤍💜💜💜💜💜🤍🤍\n🤍🤍🤍💜💜💜🤍🤍🤍\n🤍🤍🤍🤍💜🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💛💛🤍💛💛🤍🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍💛💛💛💛💛💛💛🤍\n🤍🤍💛💛💛💛💛🤍🤍\n🤍🤍🤍💛💛💛🤍🤍🤍\n🤍🤍🤍🤍💛🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        #next

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💜❤️🤍❤️❤️🤍🤍\n🤍❤️💜❤️❤️❤️💙❤️🤍\n🤍❤️❤️💙❤️❤️❤️❤️🤍\n🤍❤️❤️❤️💙❤️❤️❤️🤍\n🤍🤍🤎🧡❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💛❤️🤍💙💛🤍🤍\n🤍❤️🧡💚❤️❤️💙❤️🤍\n🤍❤️❤️💛❤️❤️💙💜🤍\n🤍❤️❤️❤️💙❤️❤️❤️🤍\n🤍🤍🤎💜💚❤️❤️🤍🤍\n🤍🤍🤍💙💛🤎🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💛💚🤍💜💜🤍🤍\n🤍💜💚💙💛🤎💚💙🤍\n🤍💙💛💚💜💜💛❤️🤍\n🤍🤎💚❤️💛💛🤎🧡🤍\n🤍🤍🤎💛💙💜❤️🤍🤍\n🤍🤍🤍💙💛🧡🤍🤍🤍\n🤍🤍🤍🤍💚🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💛💜🤍💜💛🤍🤍\n🤍💜💙🧡💛💚💛💜🤍\n🤍💙🧡💚💜🧡💜💛🤍\n🤍💜💚🧡🧡💛🤎🧡🤍\n🤍🤍🧡💛💙💜💙🤍🤍\n🤍🤍🤍🧡💜💚🤍🤍🤍\n🤍🤍🤍🤍🧡️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💙🧡🤍🤎🧡🤍🤍\n🤍💚💙💜🧡🧡🤎🧡🤍\n🤍🧡💛💛💚💛🧡🧡🤍\n🤍💚💙💛💚💜💜🧡🤍\n🤍🤍🧡💛💜💚🤎🤍🤍\n🤍🤍🤍💚💙🧡🤍🤍🤍\n🤍🤍🤍🤍💛🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍💜💚🤍💙💛🤍🤍\n🤍💜💙🧡💛💚🤎🧡🤍\n🤍💛🧡🧡💛💛💚💛🤍\n🤍🧡🧡💛🤎🧡💜🧡🤍\n🤍🤍💚🧡🧡💛🤎🤍🤍\n🤍🤍🤍🤎🧡💛🤍🤍🤍\n🤍🤍🤍🤍🤎🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        #NEXT

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍💜💙🧡💛💚🤎🧡🤍\n🤍💛🧡🧡💛💛💚💛🤍\n🤍🧡🧡💛🤎🧡💜🧡🤍\n🤍🤍💚🧡🧡💛🤎🤍🤍\n🤍🤍🤍🤎🧡💛🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍💛🧡🧡💛💛💚💛🤍\n🤍🧡🧡💛🤎🧡💜🧡🤍\n🤍🤍💚🧡🧡💛🤎🤍🤍\n🤍🤍🤍❤️🧡❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️🧡🧡💛💛💚❤️🤍\n🤍🧡🧡💛🤎🧡💜🧡🤍\n🤍🤍❤️🧡🧡💛❤️🤍🤍\n🤍🤍🤍❤️🧡❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️🧡🧡💛💛💚❤️🤍\n🤍❤️🧡💛🤎🧡💜❤️🤍\n🤍🤍❤️🧡🧡💛❤️🤍🤍\n🤍🤍🤍❤️🧡❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️🧡🧡💛💛💚❤️🤍\n🤍❤️🧡💛🤎🧡💜❤️🤍\n🤍🤍❤️🧡🧡💛❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️🧡🧡💛💛💚❤️🤍\n🤍❤️🧡💛🤎🧡💜❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️🧡🧡💛💛💚❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️💙🧡💛💚🤎❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '🤍🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        #NEXT

        tbp = '❤️🤍🤍🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️🤍🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️🤍🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️🤍🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️🤍🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️🤍🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)


        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️🤍❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️🤍❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️🤍🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️🤍❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)



        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️🤍🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️🤍❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)


        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️🤍🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️🤍🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️🤍❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️🤍🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️🤍🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️🤍🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n🤍🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)


        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️🤍🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️🤍🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️🤍🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️🤍🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️🤍🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️🤍🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️🤍🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️️\n❤️❤️❤️❤️❤️❤️❤️❤️🤍'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️❤️❤️❤️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        #FINAL

        tbp = '❤️❤️❤️❤️❤️❤️❤️❤️\n️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️️❤️❤️❤️❤️❤️❤️❤️\n❤️❤️️❤️❤️❤️❤️❤️❤️\n️❤️❤️❤️❤️❤️❤️❤️❤️\n️❤️❤️❤️❤️❤️❤️❤️❤️\n❤️️❤️❤️❤️❤️️❤️❤️❤️\n❤️❤️️❤️❤️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️❤️❤️❤️❤️❤️❤️❤️\n️️❤️❤️❤️❤️❤️❤️❤️\n️❤️️❤️❤️❤️❤️❤️❤️\n️️❤️❤️❤️❤️❤️❤️❤️\n️️❤️❤️❤️❤️❤️❤️❤️\n️️❤️❤️❤️❤️❤️❤️❤️️\n️❤️️❤️❤️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️️❤️️❤️❤️❤️❤️❤️\n️️️❤️❤️❤️❤️❤️❤️\n️️❤️️❤️❤️❤️❤️❤️\n️️❤️️❤️❤️❤️❤️❤️\n️️️❤️❤️❤️❤️❤️❤️\n️❤️️️❤️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️️️❤️❤️️❤️❤️❤️\n️️❤️️❤️️❤️❤️❤️\n️️❤️️❤️️❤️❤️❤️\n️️️❤️❤️️❤️❤️❤️\n️❤️️️️❤️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️❤️️❤️️❤️❤️\n️️❤️️❤️️️❤️❤️\n️️️❤️️❤️❤️❤️\n️❤️️️❤️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️️❤️️❤️️️❤️\n️️️❤️️❤️❤️\n️❤️️️❤️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️️️️️❤️️❤️\n️❤️️️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '️️️️️️️️️❤️'
        msg.edit(tbp)
        sleep(0.4)

        tbp = '❣️'
        msg.edit(tbp+orig_text+'\n'+about)
        sleep(0.4)


    except FloodWait as e:
        sleep(e.x)

app.run()

